app/controllers/championships_controller.rb

  def index
    @championships = Championship.all
---
SELECT `championships`.* FROM `championships`

  def create
    @championship = Championship.new(championship_params)

    respond_to do |format|
      if @championship.save
---
INSERT INTO `championships` (`name`, `start`, `end`, `created_at`, `updated_at`) VALUES ('unnnn', '2015-07-09', '2015-07-09', '2015-07-09 23:45:44', '2015-07-09 23:45:44')

    def set_championship
      @championship = Championship.find(params[:id])
---
SELECT  `championships`.* FROM `championships` WHERE `championships`.`id` = 1 LIMIT 1