app/controllers/rounds_controller.rb

SELECT `rounds`.* FROM `rounds`
---
  def index
    @rounds = Round.all

DELETE FROM `rounds` WHERE `rounds`.`id` = 6
---
  def destroy
    @round.destroy

SELECT  `rounds`.* FROM `rounds` WHERE `rounds`.`id` = 14 LIMIT 1
---
    def set_round
      @round = Round.find(params[:id])